Тестовая_база_ERP_14/src/Catalogs/РЭЙ_КонтрактыВЭД/РЭЙ_КонтрактыВЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_КонтрактыВЭД</name>
  <attributes>
    <name>Автопролонгация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяОговорка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.РЭЙ_ВидыПодтверждающихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрактаВЭД</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыКонтрактовВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтартовойДатыОжидаемогоСрока</name>
    <type>
      <types>EnumRef.РЭЙ_ВидыСтартовыхДатОжидаемогоСрока</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияОбязательствПоКонтракту</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставкиОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругиеМетодыОпределенияПроцентнойСтавки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инкотермс</name>
    <type>
      <types>CatalogRef.РЭЙ_Инкотермс</types>
    </type>
  </attributes>
  <attributes>
    <name>ИныеПлатежиПредусмотренныеКредитнымДоговором</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПериодичностиФиксированныхПлатежей</name>
    <type>
      <types>EnumRef.РЭЙ_КодыПериодичностиФиксированныхПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДляВозвратаАвансаПоИмпортномуКонтракту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДополнительное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактБезСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактПредмет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактПредметАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактТоварный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитныйДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитныйСиндикат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныеФинОрганизации</name>
    <type>
      <types>EnumRef.РЭЙ_МеждународныеФинОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоДнейДляУведомленияОПрекращенииДействияКонтракта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Многосторонний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеДействует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЯвляетсяОбъектомВалютногоКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеЗаполненияГрафикаПогашения</name>
    <comment>0 - Сведения из кредитного договора, 1 -  Оценочные данные</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежаПредоплаты</name>
    <type>
      <types>EnumRef.РЭЙ_ОтсрочкаПлатежаПредоплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаДопСоглашений</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСделки</name>
    <type>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодическиеФиксированныеПлатежи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодФиксированныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставлениеЗайма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПривлечениеКредитаЗайма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентныеПлатежиПоКредитамВЭД</name>
    <type>
      <types>EnumRef.РЭЙ_ПроцентныеПлатежиПоКредитамВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрямоеИнвестирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПереходаРисков</name>
    <type>
      <types>CatalogRef.РЭЙ_ПунктыПереходаРисков</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПроцентнойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенияВалКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РамочныйКонтракт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СправкиВКсНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокиПогашенияКредитовВЭД</name>
    <type>
      <types>EnumRef.РЭЙ_СрокиПогашенияКредитовВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЛИБОР</name>
    <type>
      <types>EnumRef.РЭЙ_СтавкаЛИБОР</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалВыручкиПодлежащаяЗачислениюНаСчетаВБанкеНерезиденте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОбеспечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПодлежащаяЗачислениюНаСчетаВБанкеНерезиденте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияИнойДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УступкаТребованияКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтавкаГодовыхПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Экспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>БанковскиеСчета</name>
    <attributes>
      <name>БанковскийСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтороныПоКонтракту</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСоглашения</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемоеКоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемоеКоличествоДнейДополнительное</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_КонтрактыВЭД/ObjectModule.bsl
Перем Скопирован Экспорт;

Процедура ПриКопировании(ОбъектКопирования)
	Скопирован=Истина;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если Контрагент <> ДоговорКонтрагента[РЭЙ_Универсализация.Реквизит_Договор_Контрагент()] Тогда
		Контрагент = ДоговорКонтрагента[РЭЙ_Универсализация.Реквизит_Договор_Контрагент()];
	КонецЕсли;
	
	Если Организация <> ДоговорКонтрагента.Организация Тогда
		Организация = ДоговорКонтрагента.Организация;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СпрРЭЙ_КонтрактыВЭД.Ссылка
		|ИЗ
		|	Справочник.РЭЙ_КонтрактыВЭД КАК СпрРЭЙ_КонтрактыВЭД
		|ГДЕ
		|	СпрРЭЙ_КонтрактыВЭД.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() > 0 Тогда
			Сообщить("По данному договору контрагента уже введен контракт ВЭД."+Символы.ПС+"Элемент справочника не может быть записан.");
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			Сообщить("Не задан договор контрагента."+Символы.ПС+"Элемент справочника не может быть записан.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
// рк+ 2013.04.15 САС						
	Если НЕ Многосторонний Тогда	
		Если СтороныПоКонтракту.Количество() <> 1 Тогда
			СтороныПоКонтракту.Очистить();
			НовСтрока = СтороныПоКонтракту.Добавить();
			НовСтрока.Контрагент = Контрагент;
			НовСтрока.Страна = Контрагент.РЭЙ_Страна;
			Новстрока.Основной = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
// рк- 2013.04.15 САС
КонецПроцедуры

Функция СформироватьНаименованиеПоНомеруИДате(НомерК, ДатаК, ПредметК,БезНомераК) Экспорт

	Возврат "Конт. "+
	 		//рк+
			//?(ПустаяСтрока(НомерК), "б/н", СокрЛП(НомерК))+ 
			?(БезНомераК,"б/н",?(ПустаяСтрока(НомерК), "","№"+СокрЛП(НомерК)))+ 
			//рк-
			?(ЗначениеЗаполнено(ДатаК)," от "+Формат(ДатаК,"ДФ=dd.MM.yyyy"), "")+
			?(ПустаяСтрока(ПредметК),""," ("+ПредметК+")");
			
КонецФункции // СформироватьНаименованиеПоНомеруИДате()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЕстьСчетВБанкеРезиденте = Ложь;
	
	Для Каждого СтрокаСчета Из БанковскиеСчета Цикл
		
		Если НЕ СтрокаСчета.БанковскийСчет.Банк.РЭЙ_НеЯвляетсяРезидентом Тогда
			
			ЕстьСчетВБанкеРезиденте = Истина;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЕстьСчетВБанкеРезиденте Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = "Укажите банковский счет в банке УК";
		Сообщение.Поле 	= "БанковскиеСчета";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	Если Автопролонгация Тогда
		ПроверяемыеРеквизиты.Добавить("МинимальноеКоличествоДнейДляУведомленияОПрекращенииДействияКонтракта");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения)= Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьДатуЗавершенияОбязательствПоКонтракту() Экспорт
	Если ЗначениеЗаполнено(КонтрактДатаОкончания) Тогда
		ДатаЗавершенияОбязательствПоКонтракту = КонтрактДатаОкончания + (КоличествоДней + КоличествоДнейДополнительное) * 24*60*60;
	Иначе
		ДатаЗавершенияОбязательствПоКонтракту = Дата("00010101");
	КонецЕсли;
КонецПроцедуры

Скопирован=Ложь;
